package JavaHome_Work;

public class HomeWork_03 {

	
	/**
	 * 使用Date输出当前系统时间，以及3天后这一刻的时间
	 */
	public static void test01(){
		
	}
	
	/**
	 * 将当前系统时间以"yyyy-MM-dd HH:mm:ss"格式输出
	 *
	 */
	public static void test02(){
		
	}
	
	/**
	 * 输入某人生日，格式为"yyyy-MM-dd"，输出到现在为止经过了多少周。
	 *
	 */
	public static void test03(){
		
	}
	
	/**
	 * 输入一个生产日期格式"yyyy-MM-dd",再输入一个数字(保质期的天数)。
	 * 然后经过计算输出促销日期，促销日期为:该商品过期日前2周的周三
	 */
	public static void test04(){
		
	}
	
	/**
	 * 实现时间的计算: 要求用户输入身份证号，若格式有误，要求其重新输入。然后根据身份证号码输出20岁生日
	 * 所在周的周三的日期。
	 * 例如:
	 * 出生日期:1992-07-15。
	 * 20岁生日:2012-07-15
	 * 当周的周三为:2012-07-18
	 *
	 */
	public static void test05(){
		
	}
	
	/**
	 * 创建一个集合，存放字符串"one","two"，"three"
	 * 然后输出该集合的元素个数。
	 * 然后输出该集合是否包含字符串"four"
	 * 然后输出集合是否不含有任何元素
	 * 然后清空集合
	 * 然后输出该集合的元素个数
	 * 然后输出集合是否不含有任何元素
	 *
	 */
	public static void test06(){
		
	}
	
	/**
	 * 要求用户首先输入员工数量，然后输入相应员工信息，格式为：
	 * name,age,gender,salary,hiredate
	 * 例如:
	 * 张三,25,男,5000,2006-02-15
	 * 每一行为一个员工信息，然后将每个员工信息解析成Emp对象。并存入到一个集合中。
	 * 在解析成Emp对象后要先查看当前集合是否包含该员工，若包含则提示该用于已存在，
	 * 否则才存入集合。
	 * 然后输出集合查看每个员工信息.
	 */
	public static void test07(){
		
	}

}
