package JavaHome_Work;

public class HomeWork_01 {

	/**
	 * 1:输出字符串"HelloWorld"的字符串长度
	 * 2:输出"HelloWorld"中"o"的位置
	 * 3:输出"HelloWorld"中从下标5出开始第一次出现"o"的位置
	 * 4:截取"HelloWorld"中的"Hello"并输出
	 * 5:截取"HelloWorld"中的"World"并输出
	 * 6:将字符串"  Hello   "中两边的空白去除后输出
	 * 7:输出"HelloWorld"中第6个字符"W"
	 * 8:输出"HelloWorld"是否是以"h"开头和"ld"结尾的。
	 * 9:将"HelloWorld"分别转换为全大写和全小写并输出。
	 */
	public static void test01(){
		
	}
	
	
	/**
	 * 将"大家好!"修改为:"大家好!我是程序员!"并输出。
	 * 然后将"大家好!我是程序员!"修改为:"大家好!我是优秀的程序员!"并输出
	 * 然后再修改为:"大家好!我是牛牛的程序员!"并输出
	 * 然后在修改为:"我是牛牛的程序员!"并输出
	 */
	public static void test02(){
			
	}
	
	
	/**
	 * 检查一个字符串是否为回文
	 * 回文:正着念与反着念一样，例如:上海自来水来自海上
	 * 编写一个回文字符串，然后调用check方法检查
	 * 该字符串是否为回文，然后输出检查结果。
	 * 若是回文则输出:是回文
	 * 否则输出:不是回文
	 */
	public static void test03(){
		
	}
	
	
	/**
	 * 要求用户从控制台输入一个email地址，然后获取该email的用户名(@之前的内容)
	 */
	public static void test04(){
		
	}
	
	/**
	 * 随机生成一个5位的英文字母验证码(大小写混搭)
	 * 然后将该验证码输出给用户，然后要求用户输入该验证码，大小写不限制。
	 * 然后判定用户输入的验证码是否有效(无论用户输入大小写，只要字母都正确即可)。
	 */
	public static void test05(){
		
	}
	
	/**
	 * 要求用户输入一个计算表达式，可以使用加减乘除。
	 * 只处理一次运算的，不要有连续加减乘除的表达式,且不做小数计算。(例:1+2+3)
	 * 例如:
	 * 1+2
	 * 然后经过处理计算结果并输出:1+2=3
	 */
	public static void test06(){
		
	}
}
